W4D5/music_app/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @album = Album.new(band_id: params[:band_id])
    @band = Band.find_by(id: params[:band_id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "albums" ("title", "year", "band_id", "studio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Album2"], ["year", 1000], ["band_id", 2], ["studio", false], ["created_at", "2019-02-01 01:12:54.909121"], ["updated_at", "2019-02-01 01:12:54.909121"]]
---
  def create
    @album = Album.new(album_params)
    @band = Band.find_by(id: album_params[:band_id])

    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @album = Album.find_by(id: params[:id])
    @band = Band.find_by(id: @album.band_id)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["year", 1991], ["updated_at", "2019-02-01 01:02:50.868861"], ["id", 1]]
---
  def update
    album = Album.find_by(id: params[:id])

    if album.update(album_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 2]]
---
  def destroy
    album = Album.find_by(id: params[:id])
    album.destroy