W4D5/music_app/app/controllers/bands_controller.rb

  def create
    band = Band.new(band_params)

    if band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Band1"], ["created_at", "2019-02-01 00:12:28.237307"], ["updated_at", "2019-02-01 00:12:28.237307"]]

  def update
    band = Band.find_by(id: params[:id])

    if band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "hello"], ["updated_at", "2019-01-31 22:20:32.995339"], ["id", 1]]

  def destroy
    band = Band.find_by(id: params[:id])

    band.delete
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]