W4D5/music_app/app/models/user.rb

  def self.find_by_credentials(params)
    user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jason"], ["LIMIT", 1]]