W4D5/music_app/app/views/bands/index.html.erb

SELECT "bands".* FROM "bands"
---

<% Band.all.each do |band| %>